#!/usr/bin/python
# -*- coding: utf-8 -*-
print 3 == 3 and (not ("testing" == "testing" or "Python" == "Fun")) # False


# -----------------------------------------------------------------------------
#                           Study Drills
# -----------------------------------------------------------------------------
# != == >= <= += -= *= /=
# != 不等于; == 等于; >= 大于等于; <= 小于等于; += increment by 加等于，在一个数的基础上，加上等号右边的数; -= 减等于，在一个数的基础上，减去等号右边的数; *= 乘等于，在一个数的基础上，乘以等号右边的数; /= 除等于，在一个数的基础上，除以等号右边的数;

print 3 == 3 and (not ("testing" == "testing" or "Python" == "Fun" and 5 == 10)) # False
